# GROUP BY

In [3]:
import pandas as pd
var = pd.DataFrame({"name":['a','b','c','d','a','b','a','b','c','c'],
                   "S_1":[12,23,45,67,12,34,23,45,89,98],
                   "S_2":[23,34,45,56,78,23,45,56,67,23]})

var

  name  S_1  S_2
0    a   12   23
1    b   23   34
2    c   45   45
3    d   67   56
4    a   12   78
5    b   34   23
6    a   23   45
7    b   45   56
8    c   89   67
9    c   98   23

In [8]:
var_new = var.groupby("name")
var_new

In [9]:
for x,y in var_new:
    print(x)
    print(y)

a
  name  S_1  S_2
0    a   12   23
4    a   12   78
6    a   23   45
b
  name  S_1  S_2
1    b   23   34
5    b   34   23
7    b   45   56
c
  name  S_1  S_2
2    c   45   45
8    c   89   67
9    c   98   23
d
  name  S_1  S_2
3    d   67   56

In [10]:
var_new.get_group("a")

  name  S_1  S_2
0    a   12   23
4    a   12   78
6    a   23   45

In [11]:
var_new.min()

      S_1  S_2
name
a      12   23
b      23   23
c      45   23
d      67   56

In [12]:
var_new.max()

      S_1  S_2
name
a      23   78
b      45   56
c      98   67
d      67   56

In [13]:
var_new.mean()

            S_1        S_2
name
a     15.666667  48.666667
b     34.000000  37.666667
c     77.333333  45.000000
d     67.000000  56.000000

In [14]:
li=list(var_new)
li

[('a',
    name  S_1  S_2
  0    a   12   23
  4    a   12   78
  6    a   23   45),
 ('b',
    name  S_1  S_2
  1    b   23   34
  5    b   34   23
  7    b   45   56),
 ('c',
    name  S_1  S_2
  2    c   45   45
  8    c   89   67
  9    c   98   23),
 ('d',
    name  S_1  S_2
  3    d   67   56)]